STMicroelectronics/stm32-mw-ipl/Inc/stm32ipl_imlib_ext.h
/*
 * This file is part of the OpenMV project.
 *
 * Copyright (c) 2013-2019 Ibrahim Abdelkader <iabdalkader@openmv.io>
 * Copyright (c) 2013-2019 Kwabena W. Agyeman <kwagyeman@openmv.io>
 *
 * This work is licensed under the MIT license, see the file LICENSE for details.
 *
 * Image processing library.
 */

#ifndef __STM32IPL_IMLIB_EXT_H__
#define __STM32IPL_IMLIB_EXT_H__

#include <stdbool.h>
#include <stddef.h>
#include <stdlib.h>
#include <stdint.h>
#include <string.h>
#include <limits.h>
#include <float.h>
#include <math.h>
#include <arm_math.h>
#include "stm32ipl_mem_alloc.h"
#include "array.h"
#include "fmath.h"
#include "collections.h"
#include "imlib_config.h"

///@cond
#define IM_LOG2_2(x)    (((x) &                0x2ULL) ? ( 2                        ) :             1) // NO ({ ... }) !
#define IM_LOG2_4(x)    (((x) &                0xCULL) ? ( 2 +  IM_LOG2_2((x) >>  2)) :  IM_LOG2_2(x)) // NO ({ ... }) !
#define IM_LOG2_8(x)    (((x) &               0xF0ULL) ? ( 4 +  IM_LOG2_4((x) >>  4)) :  IM_LOG2_4(x)) // NO ({ ... }) !
#define IM_LOG2_16(x)   (((x) &             0xFF00ULL) ? ( 8 +  IM_LOG2_8((x) >>  8)) :  IM_LOG2_8(x)) // NO ({ ... }) !
#define IM_LOG2_32(x)   (((x) &         0xFFFF0000ULL) ? (16 + IM_LOG2_16((x) >> 16)) : IM_LOG2_16(x)) // NO ({ ... }) !
#define IM_LOG2(x)      (((x) & 0xFFFFFFFF00000000ULL) ? (32 + IM_LOG2_32((x) >> 32)) : IM_LOG2_32(x)) // NO ({ ... }) !

#define INT8_T_BITS     (sizeof(int8_t) * 8)
#define INT8_T_MASK     (INT8_T_BITS - 1)
#define INT8_T_SHIFT    IM_LOG2(INT8_T_MASK)

#define INT16_T_BITS    (sizeof(int16_t) * 8)
#define INT16_T_MASK    (INT16_T_BITS - 1)
#define INT16_T_SHIFT   IM_LOG2(INT16_T_MASK)

#define INT32_T_BITS    (sizeof(int32_t) * 8)
#define INT32_T_MASK    (INT32_T_BITS - 1)
#define INT32_T_SHIFT   IM_LOG2(INT32_T_MASK)

#define INT64_T_BITS    (sizeof(int64_t) * 8)
#define INT64_T_MASK    (INT64_T_BITS - 1)
#define INT64_T_SHIFT   IM_LOG2(INT64_T_MASK)

#define UINT8_T_BITS    (sizeof(uint8_t) * 8)
#define UINT8_T_MASK    (UINT8_T_BITS - 1)
#define UINT8_T_SHIFT   IM_LOG2(UINT8_T_MASK)

#define UINT16_T_BITS   (sizeof(uint16_t) * 8)
#define UINT16_T_MASK   (UINT16_T_BITS - 1)
#define UINT16_T_SHIFT  IM_LOG2(UINT16_T_MASK)

#define UINT32_T_BITS   (sizeof(uint32_t) * 8)
#define UINT32_T_MASK   (UINT32_T_BITS - 1)
#define UINT32_T_SHIFT  IM_LOG2(UINT32_T_MASK)

#define UINT64_T_BITS   (sizeof(uint64_t) * 8)
#define UINT64_T_MASK   (UINT64_T_BITS - 1)
#define UINT64_T_SHIFT  IM_LOG2(UINT64_T_MASK)
///@endcond

// STM32IPL
/**
 * @brief Structure used to access single channels of RGB888 images.
 */
typedef struct _rgb888_t
{
	uint8_t b; /**< Blue channel. */
	uint8_t g; /**< Green channel. */
	uint8_t r; /**< Red channel. */
} rgb888_t;

/////////////////
// Point Stuff //
/////////////////
/**
 * @brief Defines a 2D point in terms of x and y coordinates.
 */
typedef struct point
{
	int16_t x; /**< Horizontal coordinate of the point. */
	int16_t y; /**< Vertical coordinate of the point. */
} point_t;

////////////////
// Line Stuff //
////////////////
/**
 * @brief Defines a line in terms of horizontal and vertical coordinates of its extreme points.
 */
typedef struct line
{
	int16_t x1; /**< X-coordinate of the first point. */
	int16_t y1; /**< Y-cordinate of the first point. */
	int16_t x2; /**< X-coordinate of the second point. */
	int16_t y2; /**< Y-coordinate of the second point. */
} line_t;

/////////////////////
// Rectangle Stuff //
/////////////////////
/**
 * @brief Defines a rectangle
 */
typedef struct rectangle
{
	int16_t x; /**< X-coordinate of the top-left corner of the rectangle. */
	int16_t y; /**< Y-coordinate of the top-left corner of the rectangle. */
	int16_t w; /**< Width of the rectangle. */
	int16_t h; /**< Height of the rectangle. */
} rectangle_t;

/////////////////
// Color Stuff //
/////////////////
/**
 * @brief Represents color ranges expressed in the L*A*B* color space.
 *
 * A range is defined with minimum and maximum values for each channel.
 * The L* values can vary between 0 and 1 when these thresholds must be used to filter Binary images.
 * The L* values can vary between 0 and 255 when these thresholds must be used to filter Grayscale images.
 * The L* values can vary between 0 and 100 when these thresholds must be used to filter RGB images.
 * The A* values can vary between -128 and 127 (used only when these thresholds must be used to filter RGB images).
 * The B* values can vary between -128 and 127 (used only when these thresholds must be used to filter RGB images).
 */
typedef struct color_thresholds_list_lnk_data
{
	uint8_t LMin; /**< Minimum L* (lightness) value. */
	uint8_t LMax; /**< Maximum L* (lightness) value. */
	int8_t AMin; /**< Minimum A* (green-red opponent) color value. */
	int8_t AMax; /**< Maximum A* (green-red opponent) color value. */
	int8_t BMin; /**< Minimum B* (blue-yellow opponent) color value. */
	int8_t BMax; /**< Maximum B* (blue-yellow opponent) color value. */
} color_thresholds_list_lnk_data_t;

/////////////////
// Color Stuff //
/////////////////
#define COLOR_THRESHOLD_BINARY(pixel, threshold, invert) \
({ \
    (((threshold)->LMin <= pixel) && (pixel <= (threshold)->LMax)) ^ invert; \
})

#define COLOR_THRESHOLD_GRAYSCALE(pixel, threshold, invert) \
({ \
    (((threshold)->LMin <= pixel) && (pixel <= (threshold)->LMax)) ^ invert; \
})

#define COLOR_THRESHOLD_RGB565(pixel, threshold, invert) \
({ \
    uint8_t _l = COLOR_RGB565_TO_L(pixel); \
    int8_t _a = COLOR_RGB565_TO_A(pixel); \
    int8_t _b = COLOR_RGB565_TO_B(pixel); \
    (((threshold)->LMin <= _l) && (_l <= (threshold)->LMax) && \
    ((threshold)->AMin <= _a) && (_a <= (threshold)->AMax) && \
    ((threshold)->BMin <= _b) && (_b <= (threshold)->BMax)) ^ invert; \
})

#define COLOR_THRESHOLD_RGB888(pixel, threshold, invert) \
({ \
    uint8_t _l = COLOR_RGB888_TO_L(pixel); \
    int8_t _a = COLOR_RGB888_TO_A(pixel); \
    int8_t _b = COLOR_RGB888_TO_B(pixel); \
    (((threshold)->LMin <= _l) && (_l <= (threshold)->LMax) && \
    ((threshold)->AMin <= _a) && (_a <= (threshold)->AMax) && \
    ((threshold)->BMin <= _b) && (_b <= (threshold)->BMax)) ^ invert; \
})

#define COLOR_BOUND_BINARY(pixel0, pixel1, threshold) \
({ \
    (abs(pixel0 - pixel1) <= (threshold)); \
})

