STMicroelectronics/stm32-mw-ipl/Inc/stm32ipl_imlib_ext.h
#define COLOR_BOUND_GRAYSCALE(pixel0, pixel1, threshold) \
({ \
    (abs(pixel0 - pixel1) <= (threshold)); \
})

#define COLOR_BOUND_RGB565(pixel0, pixel1, threshold) \
({ \
    (abs(COLOR_RGB565_TO_R5(pixel0) - COLOR_RGB565_TO_R5(pixel1)) <= COLOR_RGB565_TO_R5(threshold)) && \
    (abs(COLOR_RGB565_TO_G6(pixel0) - COLOR_RGB565_TO_G6(pixel1)) <= COLOR_RGB565_TO_G6(threshold)) && \
    (abs(COLOR_RGB565_TO_B5(pixel0) - COLOR_RGB565_TO_B5(pixel1)) <= COLOR_RGB565_TO_B5(threshold)); \
})

///@cond
#define COLOR_BINARY_MIN 0
#define COLOR_BINARY_MAX 1
#define COLOR_GRAYSCALE_BINARY_MIN 0x00
#define COLOR_GRAYSCALE_BINARY_MAX 0xFF
#define COLOR_RGB565_BINARY_MIN 0x0000
#define COLOR_RGB565_BINARY_MAX 0xFFFF

#define COLOR_GRAYSCALE_MIN 0
#define COLOR_GRAYSCALE_MAX 255

#define COLOR_R5_MIN 0
#define COLOR_R5_MAX 31
#define COLOR_G6_MIN 0
#define COLOR_G6_MAX 63
#define COLOR_B5_MIN 0
#define COLOR_B5_MAX 31

#define COLOR_R8_MIN 0
#define COLOR_R8_MAX 255
#define COLOR_G8_MIN 0
#define COLOR_G8_MAX 255
#define COLOR_B8_MIN 0
#define COLOR_B8_MAX 255

#define COLOR_L_MIN 0
#define COLOR_L_MAX 100
#define COLOR_A_MIN -128
#define COLOR_A_MAX 127
#define COLOR_B_MIN -128
#define COLOR_B_MAX 127

#define COLOR_Y_MIN 0
#define COLOR_Y_MAX 255
#define COLOR_U_MIN -128
#define COLOR_U_MAX 127
#define COLOR_V_MIN -128
#define COLOR_V_MAX 127
///@endcond

// RGB565 Stuff //
#define COLOR_RGB565_TO_R5(pixel) (((pixel) >> 11) & 0x1F)

#define COLOR_RGB565_TO_R8(pixel) \
({ \
	uint16_t __pixel = (pixel); \
	__pixel = (__pixel >> 8) & 0xF8; \
	__pixel | (__pixel >> 5); \
})

#define COLOR_RGB565_TO_G6(pixel) (((pixel) >> 5) & 0x3F)

#define COLOR_RGB565_TO_G8(pixel) \
({ \
	uint16_t __pixel = (pixel); \
	__pixel = (__pixel >> 3) & 0xFC; \
	__pixel | (__pixel >> 6); \
})

#define COLOR_RGB565_TO_B5(pixel) ((pixel) & 0x1F)

#define COLOR_RGB565_TO_B8(pixel) \
({ \
	uint16_t __pixel = (pixel); \
	__pixel = (__pixel << 3) & 0xF8; \
	__pixel | (__pixel >> 5); \
})

#define COLOR_R5_G6_B5_TO_RGB565(r5, g6, b5) (((r5) << 11) | ((g6) << 5) | (b5))

#define COLOR_R8_G8_B8_TO_RGB565(r8, g8, b8) ((((r8) & 0xF8) << 8) | (((g8) & 0xFC) << 3) | ((b8) >> 3))

#define COLOR_RGB888_TO_Y(r8, g8, b8) ((((r8) * 38) + ((g8) * 75) + ((b8) * 15)) >> 7) // 0.299R + 0.587G + 0.114B

#define COLOR_RGB565_TO_Y(rgb565) \
({ \
	int r = COLOR_RGB565_TO_R8((rgb565)); \
	int g = COLOR_RGB565_TO_G8((rgb565)); \
	int b = COLOR_RGB565_TO_B8((rgb565)); \
	COLOR_RGB888_TO_Y(r, g, b); \
})

#define COLOR_Y_TO_RGB888(pixel) ((pixel) * 0x010101)

#define COLOR_Y_TO_RGB565(pixel) \
({ \
	int __rb_pixel = ((pixel) >> 3) & 0x1F; \
	(__rb_pixel * 0x0801) + (((pixel) << 3) & 0x7E0); \
})

#define COLOR_RGB888_TO_U(r8, g8, b8) ((((r8) * -21) - ((g8) * 43) + ((b8) * 64)) >> 7) // -0.168736R - 0.331264G + 0.5B

#define COLOR_RGB565_TO_U(rgb565) \
({ \
	int r = COLOR_RGB565_TO_R8((rgb565)); \
	int g = COLOR_RGB565_TO_G8((rgb565)); \
	int b = COLOR_RGB565_TO_B8((rgb565)); \
	COLOR_RGB888_TO_U(r, g, b); \
})

#define COLOR_RGB888_TO_V(r8, g8, b8) ((((r8) * 64) - ((g8) * 54) - ((b8) * 10)) >> 7) // 0.5R - 0.418688G - 0.081312B

#define COLOR_RGB565_TO_V(rgb565) \
({ \
	int r = COLOR_RGB565_TO_R8((rgb565)); \
	int g = COLOR_RGB565_TO_G8((rgb565)); \
	int b = COLOR_RGB565_TO_B8((rgb565)); \
	COLOR_RGB888_TO_V(r, g, b); \
})

extern const int8_t lab_table[196608 / 2];

#ifdef IMLIB_ENABLE_LAB_LUT
#define COLOR_RGB565_TO_L(pixel) lab_table[((pixel>>1) * 3) + 0]
#define COLOR_RGB565_TO_A(pixel) lab_table[((pixel>>1) * 3) + 1]
#define COLOR_RGB565_TO_B(pixel) lab_table[((pixel>>1) * 3) + 2]
#else
#define COLOR_RGB565_TO_L(pixel) imlib_rgb565_to_l(pixel)
#define COLOR_RGB565_TO_A(pixel) imlib_rgb565_to_a(pixel)
#define COLOR_RGB565_TO_B(pixel) imlib_rgb565_to_b(pixel)
#endif

// FIXME: lut based version is missing here.
#define COLOR_RGB888_TO_L(pixel) imlib_rgb888_to_l(pixel) // STM32IPL
#define COLOR_RGB888_TO_A(pixel) imlib_rgb888_to_a(pixel) // STM32IPL
#define COLOR_RGB888_TO_B(pixel) imlib_rgb888_to_b(pixel) // STM32IPL

#define COLOR_LAB_TO_RGB565(l, a, b) imlib_lab_to_rgb(l, a, b)
#define COLOR_YUV_TO_RGB565(y, u, v) imlib_yuv_to_rgb((y) + 128, u, v)

#define COLOR_YUV_TO_RGB888(y, u, v) imlib_yuv_to_rgb888((y) + 128, u, v) // STM32IPL
#define COLOR_LAB_TO_RGB888(l, a, b) imlib_lab_to_rgb888(l, a, b) // STM32IPL

#define COLOR_BAYER_TO_RGB565(img, x, y, r, g, b)            \
({                                                           \                             \
    if ((y % 2) == 0) {                                    \
        if ((x % 2) == 0) {                                \
            r = (IM_GET_RAW_PIXEL(img, x-1, y-1)  +      \
                 IM_GET_RAW_PIXEL(img, x+1, y-1)  +      \
                 IM_GET_RAW_PIXEL(img, x-1, y+1)  +      \
                 IM_GET_RAW_PIXEL(img, x+1, y+1)) >> 2;  \
                                                             \
            g = (IM_GET_RAW_PIXEL(img, x,   y-1)  +      \
                 IM_GET_RAW_PIXEL(img, x,   y+1)  +      \
                 IM_GET_RAW_PIXEL(img, x-1, y)    +      \
                 IM_GET_RAW_PIXEL(img, x+1, y))   >> 2;  \
                                                             \
            b = IM_GET_RAW_PIXEL(img,  x, y);            \
        } else {                                             \
            r = (IM_GET_RAW_PIXEL(img, x, y-1)  +        \
                 IM_GET_RAW_PIXEL(img, x, y+1)) >> 1;    \
                                                             \
            b = (IM_GET_RAW_PIXEL(img, x-1, y)  +        \
                 IM_GET_RAW_PIXEL(img, x+1, y)) >> 1;    \
                                                             \
            g =  IM_GET_RAW_PIXEL(img, x, y);            \
        }                                                    \
    } else {                                                 \
        if ((x % 2) == 0) {                                \
            r = (IM_GET_RAW_PIXEL(img, x-1, y)  +        \
                 IM_GET_RAW_PIXEL(img, x+1, y)) >> 1;    \
                                                             \
            g =  IM_GET_RAW_PIXEL(img, x, y);            \
                                                             \
            b = (IM_GET_RAW_PIXEL(img, x, y-1)  +        \
                 IM_GET_RAW_PIXEL(img, x, y+1)) >> 1;    \
        } else {                                             \
            r = IM_GET_RAW_PIXEL(img,  x, y);            \
                                                             \
            g = (IM_GET_RAW_PIXEL(img, x, y-1)    +      \
                 IM_GET_RAW_PIXEL(img, x, y+1)    +      \
                 IM_GET_RAW_PIXEL(img, x-1, y)    +      \
                 IM_GET_RAW_PIXEL(img, x+1, y))   >> 2;  \
                                                             \
            b = (IM_GET_RAW_PIXEL(img, x-1, y-1)  +      \
                 IM_GET_RAW_PIXEL(img, x+1, y-1)  +      \
                 IM_GET_RAW_PIXEL(img, x-1, y+1)  +      \
                 IM_GET_RAW_PIXEL(img, x+1, y+1)) >> 2;  \
        }                                                    \
    }                                                        \
    r  = r >> 3;                                             \
    g  = g >> 2;                                             \
    b  = b >> 3;                                             \
})

#define COLOR_BINARY_TO_GRAYSCALE(pixel) ((pixel) * COLOR_GRAYSCALE_MAX)
#define COLOR_BINARY_TO_RGB565(pixel) COLOR_YUV_TO_RGB565(((pixel) ? 127 : -128), 0, 0)
#define COLOR_BINARY_TO_RGB888(pixel) COLOR_YUV_TO_RGB888(((pixel) ? 127 : -128), 0, 0) // STM32IPL
#define COLOR_RGB565_TO_BINARY(pixel) (COLOR_RGB565_TO_Y(pixel) > (((COLOR_Y_MAX - COLOR_Y_MIN) / 2) + COLOR_Y_MIN))
#define COLOR_RGB565_TO_GRAYSCALE(pixel) COLOR_RGB565_TO_Y(pixel)
#define COLOR_GRAYSCALE_TO_BINARY(pixel) ((pixel) > (((COLOR_GRAYSCALE_MAX - COLOR_GRAYSCALE_MIN) / 2) + COLOR_GRAYSCALE_MIN))
#define COLOR_GRAYSCALE_TO_RGB565(pixel) COLOR_YUV_TO_RGB565(((pixel) - 128), 0, 0)
#define COLOR_RGB888_TO_GRAYSCALE(pixel) COLOR_RGB888_TO_Y((pixel).r, (pixel).g, (pixel).b) // STM32IPL
#define COLOR_RGB888_TO_BINARY(pixel) (COLOR_RGB888_TO_GRAYSCALE(pixel) > (((COLOR_Y_MAX - COLOR_Y_MIN) / 2) + COLOR_Y_MIN)) // STM32IPL

/////////////////
// Image Stuff //
/////////////////
/**
 * @brief Enumerator representing the image's data formats.
 */
typedef enum image_bpp
{
	IMAGE_BPP_BINARY,       /* BPP = 0 */			/**< Binary image. Each pixel can assume 0-1 values. Image lines are padded with zeros and aligned to 32 bits. */
	IMAGE_BPP_GRAYSCALE,    /* BPP = 1 */			/**< Grayscale image. Each pixel can assume values in the range [0, 255]. */
	IMAGE_BPP_RGB565,       /* BPP = 2 */			/**< Color image. Each pixel is represented with 16 bits; R and B channels are described with 5 bits, G with 6 bits. */
	IMAGE_BPP_BAYER,        /* BPP = 3 */			/**< Not used by STM32IPL. */
	IMAGE_BPP_RGB888,       /* BPP = 4 STM32IPL */	/**< Color image. Each pixel is represented with 24 bits, 8 bits for each EGB channel. */
	IMAGE_BPP_JPEG          /* BPP > 4 */			/**< Not used by STM32IPL. */
} image_bpp_t;

/**
 * @brief Represents the image in terms of its width, height, format, pointer to the pixels data.
 */
typedef struct image
{
	int w;		/**< Width of the image (pixels). */
	int h;		/**< Height of the image (pixels). */
	int bpp;	/**< Format of the image (actually contains image_bpp_t values). */
	union
	{
		uint8_t *pixels;	/**< Pointer to the pixels data. */
		uint8_t *data;		/**< Pointer to the pixels data. */
	};
} image_t;

