STMicroelectronics/stm32-mw-ipl/Inc/stm32ipl_imlib_ext.h
///@cond
#define IMAGE_BINARY_LINE_LEN(image) (((image)->w + UINT32_T_MASK) >> UINT32_T_SHIFT)
#define IMAGE_BINARY_LINE_LEN_BYTES(image) (IMAGE_BINARY_LINE_LEN(image) * sizeof(uint32_t))

#define IMAGE_GRAYSCALE_LINE_LEN(image) ((image)->w)
#define IMAGE_GRAYSCALE_LINE_LEN_BYTES(image) (IMAGE_GRAYSCALE_LINE_LEN(image) * sizeof(uint8_t))

#define IMAGE_RGB565_LINE_LEN(image) ((image)->w)
#define IMAGE_RGB565_LINE_LEN_BYTES(image) (IMAGE_RGB565_LINE_LEN(image) * sizeof(uint16_t))

// STM32IPL
#define IMAGE_RGB888_LINE_LEN(image) ((image)->w)
#define IMAGE_RGB888_LINE_LEN_BYTES(image) (IMAGE_RGB888_LINE_LEN(image) * sizeof(rgb888_t))

#define IMAGE_GET_BINARY_PIXEL(image, x, y) \
({ \
    (((uint32_t *)(image)->data)[((((image)->w + UINT32_T_MASK) >> UINT32_T_SHIFT) * (y)) + ((x) >> UINT32_T_SHIFT)] >> ((x) & UINT32_T_MASK)) & 1; \
})

#define IMAGE_PUT_BINARY_PIXEL(image, x, y, v) \
({ \
    size_t _i = ((((image)->w + UINT32_T_MASK) >> UINT32_T_SHIFT) * (y)) + ((x) >> UINT32_T_SHIFT); \
    size_t _j = (x) & UINT32_T_MASK; \
    ((uint32_t *)(image)->data)[_i] = (((uint32_t *)(image)->data)[_i] & (~(1 << _j))) | (((v) & 1) << _j); \
})

#define IMAGE_CLEAR_BINARY_PIXEL(image, x, y) \
({ \
    ((uint32_t *)(image)->data)[((((image)->w + UINT32_T_MASK) >> UINT32_T_SHIFT) * (y)) + ((x) >> UINT32_T_SHIFT)] &= ~(1 << ((x) & UINT32_T_MASK)); \
})

#define IMAGE_SET_BINARY_PIXEL(image, x, y) \
({ \
    ((uint32_t *)(image)->data)[((((image)->w + UINT32_T_MASK) >> UINT32_T_SHIFT) * (y)) + ((x) >> UINT32_T_SHIFT)] |= 1 << ((x) & UINT32_T_MASK); \
})

#define IMAGE_GET_GRAYSCALE_PIXEL(image, x, y) \
({ \
    ((uint8_t *)(image)->data)[((image)->w * (y)) + (x)]; \
})

#define IMAGE_PUT_GRAYSCALE_PIXEL(image, x, y, v) \
({ \
    ((uint8_t *)(image)->data)[((image)->w * (y)) + (x)] = (v); \
})

#define IMAGE_GET_RGB565_PIXEL(image, x, y) \
({ \
    ((uint16_t *)(image)->data)[((image)->w * (y)) + (x)]; \
})

#define IMAGE_PUT_RGB565_PIXEL(image, x, y, v) \
({ \
    ((uint16_t *)(image)->data)[((image)->w * (y)) + (x)] = (v); \
})

// STM32IPL
#define IMAGE_PUT_RGB888_PIXEL(image, x, y, v) \
({ \
    ((rgb888_t *)(image)->data)[((image)->w * (y)) + (x)] = (v); \
})

// STM32IPL
#define IMAGE_GET_RGB888_PIXEL(image, x, y) \
({ \
	((rgb888_t *)(image)->data)[((image)->w * (y)) + (x)]; \
})

// Fast Stuff //
#define IMAGE_COMPUTE_BINARY_PIXEL_ROW_PTR(image, y) \
({ \
   ((uint32_t*)((image)->data)) + ((((image)->w + UINT32_T_MASK) >> UINT32_T_SHIFT) * (y)); \
})

#define IMAGE_GET_BINARY_PIXEL_FAST(row_ptr, x) \
({ \
    (row_ptr[(x) >> UINT32_T_SHIFT] >> ((x) & UINT32_T_MASK)) & 1; \
})

#define IMAGE_PUT_BINARY_PIXEL_FAST(row_ptr, x, v) \
({ \
    size_t _i = (x) >> UINT32_T_SHIFT; \
    size_t _j = (x) & UINT32_T_MASK; \
    row_ptr[_i] = (row_ptr[_i] & (~(1 << _j))) | (((v) & 1) << _j); \
})

#define IMAGE_CLEAR_BINARY_PIXEL_FAST(row_ptr, x) \
({ \
    row_ptr[(x) >> UINT32_T_SHIFT] &= ~(1 << ((x) & UINT32_T_MASK)); \
})

#define IMAGE_SET_BINARY_PIXEL_FAST(row_ptr, x) \
({ \
    row_ptr[(x) >> UINT32_T_SHIFT] |= 1 << ((x) & UINT32_T_MASK); \
})

#define IMAGE_COMPUTE_GRAYSCALE_PIXEL_ROW_PTR(image, y) \
({ \
    ((uint8_t *)(image)->data) + ((image)->w * (y)); \
})

#define IMAGE_GET_GRAYSCALE_PIXEL_FAST(row_ptr, x) \
({ \
    row_ptr[(x)]; \
})

#define IMAGE_PUT_GRAYSCALE_PIXEL_FAST(row_ptr, x, v) \
({ \
    row_ptr[(x)] = (v); \
})

#define IMAGE_COMPUTE_RGB565_PIXEL_ROW_PTR(image, y) \
({ \
    ((uint16_t *)(image)->data) + ((image)->w * (y)); \
})

#define IMAGE_GET_RGB565_PIXEL_FAST(row_ptr, x) \
({ \
    row_ptr[(x)]; \
})

#define IMAGE_PUT_RGB565_PIXEL_FAST(row_ptr, x, v) \
({ \
    row_ptr[(x)] = (v); \
})

// STM32IPL
#define IMAGE_COMPUTE_RGB888_PIXEL_ROW_PTR(image, y) \
({ \
    ((rgb888_t*)((image)->data)) + ((image)->w * (y)); \
})

// STM32IPL
#define IMAGE_GET_RGB888_PIXEL_FAST(row_ptr, x) \
({ \
    (row_ptr)[(x)]; \
})

// STM32IPL
#define IMAGE_PUT_RGB888_PIXEL_FAST(row_ptr, x, v) \
({ \
    (row_ptr)[(x)] = (v); \
})

// Old Image Macros - Will be refactor and removed. But, only after making sure through testing new macros work.

#define IM_RGB5652L(p) \
    ({lab_table[(((p) >> 1) * 3) + 0];})

#define IM_RGB5652A(p) \
    ({lab_table[(((p) >> 1) * 3) + 1];})

#define IM_RGB5652B(p) \
    ({lab_table[(((p) >> 1) * 3) + 2];})

// Grayscale maxes
#define IM_MAX_GS (255)

// RGB565 maxes
#define IM_MAX_R5 (31)
#define IM_MAX_G6 (63)
#define IM_MAX_B5 (31)

// Grayscale histogram
#define IM_G_HIST_SIZE (256)
#define IM_G_HIST_OFFSET (0)

// LAB histogram
#define IM_L_HIST_SIZE (256)
#define IM_L_HIST_OFFSET (0)
#define IM_A_HIST_SIZE (256)
#define IM_A_HIST_OFFSET (256)
#define IM_B_HIST_SIZE (256)
#define IM_B_HIST_OFFSET (512)

#define IM_IS_BINARY(img) \
    ({img->bpp == IMAGE_BPP_BINARY;})

#define IM_IS_GS(img) \
    ({img->bpp == IMAGE_BPP_GRAYSCALE;})

#define IM_IS_RGB565(img) \
    ({img->bpp == IMAGE_BPP_RGB565;})

#define IM_IS_BAYER(img) \
    ({img->bpp == IMAGE_BPP_BAYER;})

#define IM_IS_JPEG(img) \
    ({img->bpp >= IMAGE_BPP_JPEG;})

#define IM_IS_MUTABLE(img) \
    ({(img->bpp == IMAGE_BPP_GRAYSCALE || img->bpp == IMAGE_BPP_RGB565);})

#define IM_X_INSIDE(img, x) \
    ({(0 <= (x)) && ((x) < img->w);})

#define IM_Y_INSIDE(img, y) \
    ({(0 <= (y)) && ((y) < img->h);})

#define IM_GET_GS_PIXEL(img, x, y) \
    ({((uint8_t*)img->pixels)[((y) * img->w) + (x)];})

#define IM_GET_RAW_PIXEL(img, x, y) \
    ({((uint8_t*)img->pixels)[((y) * img->w) + (x)];})

#define IM_GET_RAW_PIXEL_CHECK_BOUNDS_X(img, x, y) \
    ({((uint8_t*)img->pixels)[((y) * img->w) + (((x) < 0) ? 0 : ((x) >= img->w) ? (img->w - 1) : (x))];})

#define IM_GET_RAW_PIXEL_CHECK_BOUNDS_Y(img, x, y) \
    ({((uint8_t*)img->pixels)[((((y) < 0) ? 0 : ((y) >= img->h) ? (img->h - 1) : (y)) * img->w) + (x)];})

#define IM_GET_RAW_PIXEL_CHECK_BOUNDS_XY(img, x, y)	\
	({((uint8_t*)img->pixels)[(((y) < 0) ? 0 : (((y) >= img->h) ? (img->h - 1) : ((y) * img->w))) + \
							  (((x) < 0) ? 0 : (((x) >= img->w) ? (img->w - 1) : (x)))];})

