STMicroelectronics/stm32-mw-ipl/Inc/stm32ipl_imlib_ext.h
#define IM_GET_RGB565_PIXEL(img, x, y) \
    ({((uint16_t*)img->pixels)[((y) * img->w) + (x)];})

#define IM_GET_RGB888_PIXEL(img, x, y) \
    ({((rgb888_t*)img->pixels)[((y) * img->w) + (x)];})

#define IM_SET_GS_PIXEL(img, x, y, p) \
    ({((uint8_t*)img->pixels)[((y) * img->w) + (x)] = (p);})

#define IM_SET_RGB565_PIXEL(img, x, y, p) \
    ({((uint16_t*)img->pixels)[((y) * img->w) + (x)] = (p);})

#define IM_SET_RGB888_PIXEL(img, x, y, p) \
    ({((rgb888_t*)img->pixels)[((y) * img->w) + (x)] = (p);})

#define IM_EQUAL(img0, img1) \
    ({(img0->w==img1->w)&&(img0->h==img1->h)&&(img0->bpp==img1->bpp);})

#define IM_TO_GS_PIXEL(img, x, y)    \
    ( img->bpp == IMAGE_BPP_GRAYSCALE ? img->pixels[((y)*img->w)+(x)] : \
    img->bpp == IMAGE_BPP_RGB565 ? COLOR_RGB565_TO_Y(((uint16_t*)img->pixels)[((y)*img->w)+(x)]) : \
    COLOR_RGB888_TO_Y( ((uint8_t*)img->pixels)[(3 * ((y) * img->w + x)) + 2], ((uint8_t*)img->pixels)[ (3 * ((y) * img->w + x)) + 1], ((uint8_t*)img->pixels)[ (3 * ((y) * img->w + x))]))
///@endcond

/**
 * @brief Structure describing an integral image.
 */
typedef struct integral_image
{
	int w;			/**< Width.*/
	int h;			/**< Height*/
	uint32_t *data;	/**< Data.*/
} i_image_t;

/**
 * @brief Structure describing an integral image using a moving window.
 */
typedef struct
{
	int w;				/**< Width.*/
	int h;				/**< Height*/
	int y_offs;			/**< Vertical offset. */
	int x_ratio;		/**< Horizontal ratio. */
	int y_ratio;		/**< Vertical ratio. */
	uint32_t **data;	/**< Data.*/
	uint32_t **swap;	/**< Swap buffer.*/
} mw_image_t;

/**
 * @brief Structure describing a window size.
 */
typedef struct size
{
	int w;	/**< Width.*/
	int h;	/**< Height*/
} wsize_t;

/**
 * @brief Structure describing a Haar cascade.
 */
typedef struct cascade
{
	int std;						/**< Image standard deviation.*/
	int step;						/**< Image scanning factor.*/
	float threshold;				/**< Detection threshold.*/
	float scale_factor;				/**< Image scaling factor.*/
	int n_stages;					/**< Number of stages in the cascade.*/
	int n_features;					/**< Number of features in the cascade.*/
	int n_rectangles;				/**< Number of rectangles in the cascade.*/
	wsize_t window;					/**< Detection window size.*/
	image_t *img;					/**< Grayscale image.*/
	mw_image_t *sum;				/**< Integral image.*/
	mw_image_t *ssq;				/**< Squared integral image.*/
	uint8_t *stages_array;			/**< Number of features per stage.*/
	int16_t *stages_thresh_array;	/**< Stages thresholds.*/
	int16_t *tree_thresh_array;		/**< Features threshold (1 per feature).*/
	int16_t *alpha1_array;			/**< Alpha1 array (1 per feature).*/
	int16_t *alpha2_array;			/**< Alpha2 array (1 per feature).*/
	int8_t *num_rectangles_array;	/**< Number of rectangles per features (1 per feature).*/
	int8_t *weights_array;			/**< Rectangles weights (1 per rectangle).*/
	int8_t *rectangles_array;		/**< Rectangles array.*/
} cascade_t;

/**
 * @brief Kind of possible template matching algorithms.
 */
typedef enum template_match
{
	SEARCH_EX, /**< Exhaustive search */
	SEARCH_DS, /**< Diamond search */
} template_match_t;

/**
 * @brief LAB histogram.
 */
typedef struct histogram
{
	int LBinCount;	/**< Number of L bins. */
	float *LBins;	/**< Pointer to the L bins. */
	int ABinCount;	/**< Number of A bins. */
	float *ABins;	/**< Pointer to the A bins. */
	int BBinCount;	/**< Number of B bins. */
	float *BBins;	/**< Pointer to the B bins. */
} histogram_t;

/**
 * @brief LAB color percentile.
 */
typedef struct percentile
{
	uint8_t LValue;	/**< Lightness (or Grayscale) percentile. */
	int8_t AValue;	/**< A percentile. */
	int8_t BValue;	/**< B percentile. */
} percentile_t;

/**
 * @brief LAB threshold.
 */
typedef struct threshold
{
	uint8_t LValue;	/**< Lightness (or Grayscale) value. */
	int8_t AValue;	/**< A value. */
	int8_t BValue;	/**< B value. */
} threshold_t;

/**
 * @brief LAB statistics calculated on an image.
 *
 * Represents mean, median, mode, standard deviation, min, max,
 * LQ (Grayscale Lower Quartile), UQ (Grayscale Upper Quartile) for each LAB channel.
 */
typedef struct statistics
{
	uint8_t LMean;		/**< Mean value of L channel. */
	uint8_t LMedian;	/**< Median value of L channel. */
	uint8_t LMode;		/**< Mode value of L channel. */
	uint8_t LSTDev;		/**< Standard deviation value of L channel. */
	uint8_t LMin;		/**< Min value of L channel. */
	uint8_t LMax;		/**< Max value of L channel. */
	uint8_t LLQ;		/**< Grayscale Lower Quartile value of L channel. */
	uint8_t LUQ;		/**< Grayscale Upper Quartile value of L channel. */

	int8_t AMean;		/**< Mean value of A channel. */
	int8_t AMedian;		/**< Median value of A channel. */
	int8_t AMode;		/**< Mode value of A channel. */
	int8_t ASTDev;		/**< Standard deviation value of A channel. */
	int8_t AMin;		/**< Min value of A channel. */
	int8_t AMax;		/**< Max value of A channel. */
	int8_t ALQ;			/**< Grayscale Lower Quartile value of A channel. */
	int8_t AUQ;			/**< Grayscale Upper Quartile value of A channel. */

	int8_t BMean;		/**< Mean value of B channel. */
	int8_t BMedian;		/**< Median value of B channel. */
	int8_t BMode;		/**< Mode value of B channel. */
	int8_t BSTDev;		/**< Standard deviation value of B channel. */
	int8_t BMin;		/**< Min value of B channel. */
	int8_t BMax;		/**< Max value of B channel. */
	int8_t BLQ;			/**< Grayscale Lower Quartile value of B channel. */
	int8_t BUQ;			/**< Grayscale Upper Quartile value of B channel. */
} statistics_t;

/**
 * @def FIND_BLOBS_CORNERS_RESOLUTION
 * @brief Defines the maximum points corners around a blob.
 *
 * Must be multiple of 4
 */
#define FIND_BLOBS_CORNERS_RESOLUTION 20  //multiple of 4

/**
 * @brief Blob representation.
 */
typedef struct find_blobs_list_lnk_data
{
	point_t corners[FIND_BLOBS_CORNERS_RESOLUTION];	/**< Representation using points. */
	rectangle_t rect;								/**< Representation using rectangle. */
	uint32_t pixels;								/**< Number of pixels composing the blob. */
	uint32_t perimeter;								/**< Size of blob's perimeter. */
	uint32_t code;									/**< Identification code of blob*/
	uint32_t count;									/**< Number of merged blobs. */
	float centroid_x;								/**< X center of the blob. */
	float centroid_y;								/**< Y center of the blob. */
	float rotation;									/**< Rotation of the blob (radians). */
	float roundness;								/**< Value (in the range [0, 1]) representing how round the object is; a circle has roundness = 1. */
	uint16_t x_hist_bins_count;						/**< Number of bins on the x-axis of histogram. */
	uint16_t y_hist_bins_count;						/**< Number of bins on the y-axis of histogram. */
	uint16_t *x_hist_bins;							/**< Histogram of the x-axis of all columns in a blob. Bin values are scaled between 0 and 1. */
	uint16_t *y_hist_bins;							/**< Histogram of the y-axis of all columns in a blob. Bin values are scaled between 0 and 1. */
	float centroid_x_acc;							/**< Not used by STM32IPL. */
	float centroid_y_acc;							/**< Not used by STM32IPL. */
	float rotation_acc_x;							/**< Not used by STM32IPL. */
	float rotation_acc_y;							/**< Not used by STM32IPL. */
	float roundness_acc;							/**< Not used by STM32IPL. */
} find_blobs_list_lnk_data_t;

/**
 * @brief Full line representation.
 *
 * Representation of the line in Cartesian and Polar coordinates with its magnitude.
 */
typedef struct find_lines_list_lnk_data
{
	line_t line;		/**< Line expressed in Cartesian coordinates. */
	uint32_t magnitude;	/**< Sum of all Sobel filter magnitudes of pixels that make up that line. */
	int16_t theta;		/**< Theta value of the line in Polar coordinates. */
	int16_t rho;		/**< Rho value of the line in Polar coordinates. */
} find_lines_list_lnk_data_t;

/**
 * @brief Circle representation.
 */
typedef struct find_circles_list_lnk_data
{
	point_t p;			/**< Center of the circle (X,Y coordinates). */
	uint16_t r;			/**< Radius of the circle (pixels). */
	uint16_t magnitude;	/**< Sum of all Sobel filter magnitudes of pixels that make up that circle. */
} find_circles_list_lnk_data_t;

///@cond
/* Color space functions. */
int8_t imlib_rgb565_to_l(uint16_t pixel);
int8_t imlib_rgb565_to_a(uint16_t pixel);
int8_t imlib_rgb565_to_b(uint16_t pixel);
int8_t imlib_rgb888_to_l(rgb888_t pixel); // STM32IPL
int8_t imlib_rgb888_to_a(rgb888_t pixel); // STM32IPL
int8_t imlib_rgb888_to_b(rgb888_t pixel); // STM32IPL
rgb888_t imlib_lab_to_rgb888(uint8_t l, int8_t a, int8_t b); // STM32IPL
uint16_t imlib_lab_to_rgb(uint8_t l, int8_t a, int8_t b);
uint16_t imlib_yuv_to_rgb(uint8_t y, int8_t u, int8_t v);
rgb888_t imlib_yuv_to_rgb888(uint8_t y, int8_t u, int8_t v); // STM32IPL
///@endcond

#endif //__STM32IPL_IMLIB_EXT_H__
